#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.VPC_ECS_Service_Dev will be created
  + resource "aws_ecs_service" "VPC_ECS_Service_Dev" {
      + cluster                            = "arn:aws:ecs:eu-central-1:068379437484:cluster/Exam-Cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "Exam-Dev"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "Exam"
          + "Name"        = "Exam-ECS Service"
          + "Owner"       = "Rainbow Gravity"
          + "Project"     = "Template Homework"
        }
      + tags_all                           = {
          + "Environment" = "Exam"
          + "Name"        = "Exam-ECS Service"
          + "Owner"       = "Rainbow Gravity"
          + "Project"     = "Template Homework"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "Exam-Dev-Container"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + ordered_placement_strategy {
          + field = "attribute:ecs.availability-zone"
          + type  = "spread"
        }
      + ordered_placement_strategy {
          + field = "instanceId"
          + type  = "spread"
        }
    }

  # aws_ecs_task_definition.Task_Dev will be created
  + resource "aws_ecs_task_definition" "Task_Dev" {
      + arn                   = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + cpu          = 128
                  + essential    = true
                  + image        = "068379437484.dkr.ecr.eu-central-1.amazonaws.com/python-app-dev:de3e15f36a82b37e3422f2646886ef53f0b297bb"
                  + memory       = 128
                  + name         = "Exam-Dev-Container"
                  + portMappings = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 0
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + family                = "Exam-Dev-APP"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
      + tags_all              = (known after apply)

      + volume {
          + host_path = "/ecs/service-storage"
          + name      = "service-storage"
        }
    }

  # aws_lb_listener.VPC_Dev_Load_Balancer_Listener_9090 will be created
  + resource "aws_lb_listener" "VPC_Dev_Load_Balancer_Listener_9090" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:068379437484:loadbalancer/app/Exam-20211019015831738000000006/403b01d403c39914"
      + port              = 9090
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.VPC_Dev_Target_Group will be created
  + resource "aws_lb_target_group" "VPC_Dev_Target_Group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = "10"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "Exam-"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-00eb6041b1973ef4e"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 5
          + matcher             = "200"
          + path                = (known after apply)
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 2
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @Sturmschwalbe84, Action: `pull_request`, Workflow: `Production env`*